app/models/url.rb

SELECT 1 AS one FROM "urls" WHERE "urls"."short_code" = $1 LIMIT $2  [["short_code", "67WyR4"], ["LIMIT", 1]]
SELECT "urls".* FROM "urls" WHERE "urls"."short_code" = $1 LIMIT $2  [["short_code", "67WyR4"], ["LIMIT", 1]]
---
  def generate_short_code
    return if short_code.present?

    retries = 0
    loop do
      self.short_code = SecureRandom.alphanumeric(SHORT_CODE_LENGTH)
      break unless Url.exists?(short_code: short_code)